Revit 2027 API
ProjectBrowserOptions Properties
The ProjectBrowserOptions type exposes the following members.
Properties
Name | Description
AutoExpandSheetViewsOnViewPlacement |  Auto expand sheet views on view placement.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ShowViewPlacementOnSheetStatusIcons |  Show the icons indicating view placement on sheet status.
Top
See Also
Reference
ProjectBrowserOptions Class
Autodesk.Revit.UI Namespace